// Дана последовательность температурных колебаний: -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
// Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.
//
//Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.
//
package main

import "fmt"

func main() {
	array := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, 0.4, 5.2, -3.6}
	group := make(map[int64][]float64, len(array))
	
	for _, item := range array {			
		tens := int64(item)/10*10
		group[tens] = append(group[tens], item)
	}

	fmt.Println(group)
}